; domain
(define (domain depot)
(:requirements :strips :typing)
(:types
    place locatable - object
    depot distributor - place
    truck hoist surface - locatable
    pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action drive
  :parameters (?x - truck ?y - place ?z - place) 
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob4859) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 distributor0)
	(clear crate10)
	(at pallet2 distributor1)
	(clear crate9)
	(at truck0 distributor1)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(at crate1 distributor1)
	(on crate1 crate0)
	(at crate2 distributor0)
	(on crate2 pallet1)
	(at crate3 distributor0)
	(on crate3 crate2)
	(at crate4 depot0)
	(on crate4 pallet0)
	(at crate5 distributor0)
	(on crate5 crate3)
	(at crate6 distributor0)
	(on crate6 crate5)
	(at crate7 depot0)
	(on crate7 crate4)
	(at crate8 distributor0)
	(on crate8 crate6)
	(at crate9 distributor1)
	(on crate9 crate1)
	(at crate10 distributor0)
	(on crate10 crate8)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 crate6)
		(on crate2 crate9)
		(on crate3 crate0)
		(on crate4 crate5)
		(on crate5 crate1)
		(on crate6 pallet0)
		(on crate7 pallet1)
		(on crate8 crate7)
		(on crate9 crate3)
		(on crate10 crate8)
	)
))

; plan
1. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 2 of 11
2. (lift hoist0 crate7 crate4 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate4)
   added: (lifting hoist0 crate7) (clear crate4)
   goals met: 2 of 11
3. (load hoist0 crate7 truck1 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck1) (available hoist0)
   goals met: 2 of 11
4. (lift hoist0 crate4 pallet0 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 pallet0)
   added: (lifting hoist0 crate4) (clear pallet0)
   goals met: 2 of 11
5. (lift hoist2 crate9 crate1 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist2) (on crate9 crate1)
   added: (lifting hoist2 crate9) (clear crate1)
   goals met: 2 of 11
6. (load hoist2 crate9 truck0 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck0) (available hoist2)
   goals met: 2 of 11
7. (lift hoist2 crate1 crate0 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist2) (on crate1 crate0)
   added: (lifting hoist2 crate1) (clear crate0)
   goals met: 2 of 11
8. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 2 of 11
9. (lift hoist1 crate10 crate8 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist1) (on crate10 crate8)
   added: (lifting hoist1 crate10) (clear crate8)
   goals met: 1 of 11
10. (load hoist1 crate10 truck0 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck0) (available hoist1)
   goals met: 1 of 11
11. (lift hoist1 crate8 crate6 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist1) (on crate8 crate6)
   added: (lifting hoist1 crate8) (clear crate6)
   goals met: 1 of 11
12. (load hoist1 crate8 truck0 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   goals met: 1 of 11
13. (lift hoist1 crate6 crate5 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate5)
   added: (lifting hoist1 crate6) (clear crate5)
   goals met: 1 of 11
14. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   goals met: 1 of 11
15. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   goals met: 1 of 11
16. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 1 of 11
17. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   goals met: 1 of 11
18. (drop hoist0 crate6 pallet0 depot0)
   deleted: (lifting hoist0 crate6) (clear pallet0)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 2 of 11
19. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   goals met: 2 of 11
20. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 2 of 11
21. (lift hoist1 crate5 crate3 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate3)
   added: (lifting hoist1 crate5) (clear crate3)
   goals met: 2 of 11
22. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   goals met: 2 of 11
23. (unload hoist1 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   goals met: 2 of 11
24. (drop hoist1 crate9 crate3 distributor0)
   deleted: (lifting hoist1 crate9) (clear crate3)
   added: (available hoist1) (at crate9 distributor0) (clear crate9) (on crate9 crate3)
   goals met: 3 of 11
25. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 3 of 11
26. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   goals met: 3 of 11
27. (drop hoist1 crate5 crate9 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate9)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate9)
   goals met: 3 of 11
28. (unload hoist1 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 3 of 11
29. (drop hoist1 crate4 crate5 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate5)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate5)
   goals met: 4 of 11
30. (unload hoist1 crate7 truck1 distributor0)
   deleted: (in crate7 truck1) (available hoist1)
   added: (lifting hoist1 crate7)
   goals met: 4 of 11
31. (drop hoist1 crate7 crate4 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate4)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate4)
   goals met: 4 of 11
32. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 4 of 11
33. (load hoist2 crate1 truck0 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck0) (available hoist2)
   goals met: 4 of 11
34. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 4 of 11
35. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   goals met: 4 of 11
36. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 4 of 11
37. (unload hoist1 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist1)
   added: (lifting hoist1 crate10)
   goals met: 4 of 11
38. (drop hoist1 crate10 crate7 distributor0)
   deleted: (lifting hoist1 crate10) (clear crate7)
   added: (available hoist1) (at crate10 distributor0) (clear crate10) (on crate10 crate7)
   goals met: 4 of 11
39. (unload hoist1 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist1)
   added: (lifting hoist1 crate1)
   goals met: 4 of 11
40. (load hoist1 crate1 truck1 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   goals met: 4 of 11
41. (lift hoist1 crate10 crate7 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist1) (on crate10 crate7)
   added: (lifting hoist1 crate10) (clear crate7)
   goals met: 4 of 11
42. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 4 of 11
43. (unload hoist0 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist0)
   added: (lifting hoist0 crate1)
   goals met: 4 of 11
44. (drop hoist0 crate1 crate6 depot0)
   deleted: (lifting hoist0 crate1) (clear crate6)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate6)
   goals met: 5 of 11
45. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 5 of 11
46. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   goals met: 5 of 11
47. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 5 of 11
48. (load hoist1 crate10 truck1 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck1) (available hoist1)
   goals met: 5 of 11
49. (lift hoist1 crate7 crate4 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate4)
   added: (lifting hoist1 crate7) (clear crate4)
   goals met: 5 of 11
50. (drop hoist0 crate8 crate1 depot0)
   deleted: (lifting hoist0 crate8) (clear crate1)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 crate1)
   goals met: 5 of 11
51. (load hoist1 crate7 truck1 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck1) (available hoist1)
   goals met: 5 of 11
52. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 5 of 11
53. (lift hoist0 crate8 crate1 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 crate1)
   added: (lifting hoist0 crate8) (clear crate1)
   goals met: 5 of 11
54. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 5 of 11
55. (unload hoist2 crate7 truck1 distributor1)
   deleted: (in crate7 truck1) (available hoist2)
   added: (lifting hoist2 crate7)
   goals met: 5 of 11
56. (drop hoist2 crate7 crate0 distributor1)
   deleted: (lifting hoist2 crate7) (clear crate0)
   added: (available hoist2) (at crate7 distributor1) (clear crate7) (on crate7 crate0)
   goals met: 5 of 11
57. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   goals met: 5 of 11
58. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 5 of 11
59. (unload hoist2 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   goals met: 5 of 11
60. (drop hoist2 crate8 crate7 distributor1)
   deleted: (lifting hoist2 crate8) (clear crate7)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 crate7)
   goals met: 6 of 11
61. (unload hoist2 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist2)
   added: (lifting hoist2 crate10)
   goals met: 6 of 11
62. (drop hoist2 crate10 crate8 distributor1)
   deleted: (lifting hoist2 crate10) (clear crate8)
   added: (available hoist2) (at crate10 distributor1) (clear crate10) (on crate10 crate8)
   goals met: 7 of 11
63. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 7 of 11
64. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 7 of 11
65. (lift hoist1 crate4 crate5 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate5)
   added: (lifting hoist1 crate4) (clear crate5)
   goals met: 6 of 11
66. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   goals met: 6 of 11
67. (lift hoist1 crate5 crate9 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate9)
   added: (lifting hoist1 crate5) (clear crate9)
   goals met: 6 of 11
68. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   goals met: 6 of 11
69. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 6 of 11
70. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 6 of 11
71. (unload hoist0 crate5 truck0 depot0)
   deleted: (in crate5 truck0) (available hoist0)
   added: (lifting hoist0 crate5)
   goals met: 6 of 11
72. (drop hoist0 crate5 crate1 depot0)
   deleted: (lifting hoist0 crate5) (clear crate1)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate1)
   goals met: 7 of 11
73. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   goals met: 7 of 11
74. (drop hoist0 crate4 crate5 depot0)
   deleted: (lifting hoist0 crate4) (clear crate5)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate5)
   goals met: 8 of 11
75. (lift hoist1 crate9 crate3 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate3)
   added: (lifting hoist1 crate9) (clear crate3)
   goals met: 7 of 11
76. (load hoist1 crate9 truck1 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck1) (available hoist1)
   goals met: 7 of 11
77. (lift hoist1 crate3 crate2 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 crate2)
   added: (lifting hoist1 crate3) (clear crate2)
   goals met: 7 of 11
78. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   goals met: 7 of 11
79. (lift hoist1 crate2 pallet1 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 pallet1)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 7 of 11
80. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 7 of 11
81. (unload hoist0 crate9 truck1 depot0)
   deleted: (in crate9 truck1) (available hoist0)
   added: (lifting hoist0 crate9)
   goals met: 7 of 11
82. (drop hoist0 crate9 crate4 depot0)
   deleted: (lifting hoist0 crate9) (clear crate4)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 crate4)
   goals met: 7 of 11
83. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 7 of 11
84. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 7 of 11
85. (load hoist1 crate2 truck1 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   goals met: 7 of 11
86. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 7 of 11
87. (load hoist0 crate3 truck1 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck1) (available hoist0)
   goals met: 7 of 11
88. (unload hoist0 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist0)
   added: (lifting hoist0 crate2)
   goals met: 7 of 11
89. (drop hoist0 crate2 crate9 depot0)
   deleted: (lifting hoist0 crate2) (clear crate9)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate9)
   goals met: 8 of 11
90. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 8 of 11
91. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 8 of 11
92. (lift hoist2 crate10 crate8 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist2) (on crate10 crate8)
   added: (lifting hoist2 crate10) (clear crate8)
   goals met: 7 of 11
93. (load hoist2 crate10 truck1 distributor1)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck1) (available hoist2)
   goals met: 7 of 11
94. (lift hoist2 crate8 crate7 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate7)
   added: (lifting hoist2 crate8) (clear crate7)
   goals met: 6 of 11
95. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   goals met: 6 of 11
96. (lift hoist2 crate7 crate0 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist2) (on crate7 crate0)
   added: (lifting hoist2 crate7) (clear crate0)
   goals met: 6 of 11
97. (load hoist2 crate7 truck1 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck1) (available hoist2)
   goals met: 6 of 11
98. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 6 of 11
99. (unload hoist1 crate7 truck1 distributor0)
   deleted: (in crate7 truck1) (available hoist1)
   added: (lifting hoist1 crate7)
   goals met: 6 of 11
100. (drop hoist1 crate7 pallet1 distributor0)
   deleted: (lifting hoist1 crate7) (clear pallet1)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 pallet1)
   goals met: 7 of 11
101. (unload hoist1 crate8 truck1 distributor0)
   deleted: (in crate8 truck1) (available hoist1)
   added: (lifting hoist1 crate8)
   goals met: 7 of 11
102. (drop hoist1 crate8 crate7 distributor0)
   deleted: (lifting hoist1 crate8) (clear crate7)
   added: (available hoist1) (at crate8 distributor0) (clear crate8) (on crate8 crate7)
   goals met: 8 of 11
103. (unload hoist1 crate10 truck1 distributor0)
   deleted: (in crate10 truck1) (available hoist1)
   added: (lifting hoist1 crate10)
   goals met: 8 of 11
104. (drop hoist1 crate10 crate8 distributor0)
   deleted: (lifting hoist1 crate10) (clear crate8)
   added: (available hoist1) (at crate10 distributor0) (clear crate10) (on crate10 crate8)
   goals met: 9 of 11
105. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   goals met: 9 of 11
106. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 9 of 11
107. (unload hoist2 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   goals met: 9 of 11
108. (drop hoist2 crate3 crate0 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate0)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 crate0)
   goals met: 10 of 11
109. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 10 of 11
110. (lift hoist0 crate2 crate9 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate9)
   added: (lifting hoist0 crate2) (clear crate9)
   goals met: 9 of 11
111. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   goals met: 9 of 11
112. (lift hoist0 crate9 crate4 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate4)
   added: (lifting hoist0 crate9) (clear crate4)
   goals met: 9 of 11
113. (load hoist0 crate9 truck0 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck0) (available hoist0)
   goals met: 9 of 11
114. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 9 of 11
115. (unload hoist2 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   goals met: 9 of 11
116. (drop hoist2 crate9 crate3 distributor1)
   deleted: (lifting hoist2 crate9) (clear crate3)
   added: (available hoist2) (at crate9 distributor1) (clear crate9) (on crate9 crate3)
   goals met: 10 of 11
117. (unload hoist2 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   goals met: 10 of 11
118. (drop hoist2 crate2 crate9 distributor1)
   deleted: (lifting hoist2 crate2) (clear crate9)
   added: (available hoist2) (at crate2 distributor1) (clear crate2) (on crate2 crate9)
   goals met: 11 of 11
